# NumberOfSizeTables Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilySizeTableManager..::..NumberOfSizeTables Property
FamilySizeTableManager Class See Also
---
The number of FamilySizeTables in a family.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int NumberOfSizeTables { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumberOfSizeTables As Integer
	Get
```

Visual C++
---
```text
public:
property int NumberOfSizeTables {
	int get ();
}
```

# See Also
FamilySizeTableManager Class
Autodesk.Revit.DB Namespace